Белгипрозем_2017/src/Catalogs/мОбъектыРабот/мОбъектыРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мОбъектыРабот</name>
  <comment>Объекты работ</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Корреспонденты</owners>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>EnumRef.мВидыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗемельногоУчастка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.мКлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Масштаб</name>
    <type>
      <types>EnumRef.мМасштабыОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сельсовет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/мОбъектыРабот/Forms/ФормаВыбора/Module.bsl
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока = НовыйОбъект;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ЗначениеЗаполнено(Параметры.Корреспондент) Тогда
    	Корреспондент = Параметры.Корреспондент;
    	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
    	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    	ЭлементОтбора.ПравоеЗначение = Корреспондент;
    	ЭлементОтбора.Использование = Истина;
    КонецЕсли;	

	Если ЗначениеЗаполнено(Параметры.ОбъектРабот) Тогда
    	ОбъектРабот = Параметры.ОбъектРабот;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НаименованиеОбъекта) Тогда
    	НаименованиеОбъекта = Параметры.НаименованиеОбъекта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Отбор) Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			Корреспондент = Параметры.Отбор.Владелец;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СтруктураАдресаЗемельногоУчастка) Тогда
		СтруктураАдресаЗемельногоУчастка = Параметры.СтруктураАдресаЗемельногоУчастка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущаяСтрока;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Корреспондент));
	ПараметрыФормы.Вставить("Корреспондент", Корреспондент);
	Если Копирование Тогда
		НаименованиеКопируемого = Элементы.Список.ТекущиеДанные.Наименование;
		СсылкаКопируемого = Элемент.ТекущиеДанные.Ссылка;
		ПараметрыФормы.Вставить("Копирование", Копирование);
		ПараметрыФормы.Вставить("НаименованиеОбъекта", НаименованиеКопируемого);
		ПараметрыФормы.Вставить("Родитель", Элемент.ТекущиеДанные.Родитель);
		ПараметрыФормы.Вставить("ПолноеНаименование", ПолучитьПолноеНаименованиеОбъектаРабот(СсылкаКопируемого));
		ПараметрыФормы.Вставить("СтруктураАдресаЗемельногоУчастка", ПолучитьСтруктуруАдресаЗемельногоУчастка(СсылкаКопируемого));
	Иначе
		ПараметрыФормы.Вставить("НаименованиеОбъекта", НаименованиеОбъекта);
		ПараметрыФормы.Вставить("Родитель", Родитель);
		//ПараметрыФормы.Вставить("Родитель", Элемент.ТекущиеДанные.Родитель);
		ПараметрыФормы.Вставить("СтруктураАдресаЗемельногоУчастка", СтруктураАдресаЗемельногоУчастка);
	КонецЕсли; 
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФормуМодально("Справочник.мОбъектыРабот.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруАдресаЗемельногоУчастка(СсылкаКопируемого)
	СтруктураАдреса = Новый Структура("Представление, ЗначенияПолей, Тип, Вид, Страна, Область, Район, Сельсовет, Город, Регион"); 
	
	КИ = СсылкаКопируемого.КонтактнаяИнформация;
	Для каждого Стр Из КИ Цикл
		Если Стр.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресЗемельногоУчасткаОбъектаРабот") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураАдреса, Стр);
			Возврат СтруктураАдреса;
		КонецЕсли; 	
	КонецЦикла; 
	Возврат Неопределено;
КонецФункции // ПолучитьСтруктуруАдресаЗемельногоУчастка(СсылкаКопируемого)

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    ТекущиеДанные = Элементы.Список.ТекущиеДанные;
    Если ТекущиеДанные <> Неопределено Тогда
        ОбъектСсылка = Элементы.Список.ТекущиеДанные.Ссылка;
        ПолноеНаименованиеОбъектаРабот = ПолучитьПолноеНаименованиеОбъектаРабот(ОбъектСсылка);
    КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПолноеНаименованиеОбъектаРабот(ОбъектСсылка)
	Возврат ОбъектСсылка.ПолноеНаименование;
КонецФункции // ПолучитьПолноеНаименованиеОбъектаРабот()
